snowfox-project/snowfox/src/hal/avr/common/ATMEGA640_1280_2560/InterruptController.cpp
}

InterruptController::~InterruptController()
{

}

/**************************************************************************************
 * PUBLIC MEMBER FUNCTIONS
 **************************************************************************************/

void InterruptController::enableInterrupt(uint8_t const int_num)
{
  switch(int_num)
  {
  case toIntNum(Interrupt::EXTERNAL_INT0                  ): util::setBit(_EIMSK , INT0_bp  ); break;
  case toIntNum(Interrupt::EXTERNAL_INT1                  ): util::setBit(_EIMSK , INT1_bp  ); break;
  case toIntNum(Interrupt::EXTERNAL_INT2                  ): util::setBit(_EIMSK , INT2_bp  ); break;
  case toIntNum(Interrupt::EXTERNAL_INT3                  ): util::setBit(_EIMSK , INT3_bp  ); break;
  case toIntNum(Interrupt::EXTERNAL_INT4                  ): util::setBit(_EIMSK , INT4_bp  ); break;
  case toIntNum(Interrupt::EXTERNAL_INT5                  ): util::setBit(_EIMSK , INT5_bp  ); break;
  case toIntNum(Interrupt::EXTERNAL_INT6                  ): util::setBit(_EIMSK , INT6_bp  ); break;
  case toIntNum(Interrupt::EXTERNAL_INT7                  ): util::setBit(_EIMSK , INT7_bp  ); break;
  case toIntNum(Interrupt::PIN_CHANGE_INT0                ): util::setBit(_PCICR , PCIE0_bp ); break;
  case toIntNum(Interrupt::PIN_CHANGE_INT1                ): util::setBit(_PCICR , PCIE1_bp ); break;
  case toIntNum(Interrupt::PIN_CHANGE_INT2                ): util::setBit(_PCICR , PCIE2_bp ); break;
  case toIntNum(Interrupt::WATCHDOG_TIMER                 ): util::setBit(_WDTCSR, WDIE_bp  ); break;
  case toIntNum(Interrupt::TIMER2_COMPARE_A               ): util::setBit(_TIMSK2, OCIE2A_bp); break;
  case toIntNum(Interrupt::TIMER2_COMPARE_B               ): util::setBit(_TIMSK2, OCIE2B_bp); break;
  case toIntNum(Interrupt::TIMER2_OVERFLOW                ): util::setBit(_TIMSK2, TOIE2_bp ); break;
  case toIntNum(Interrupt::TIMER1_CAPTURE                 ): util::setBit(_TIMSK1, ICIE1_bp ); break;
  case toIntNum(Interrupt::TIMER1_COMPARE_A               ): util::setBit(_TIMSK1, OCIE1A_bp); break;
  case toIntNum(Interrupt::TIMER1_COMPARE_B               ): util::setBit(_TIMSK1, OCIE1B_bp); break;
  case toIntNum(Interrupt::TIMER1_COMPARE_C               ): util::setBit(_TIMSK1, OCIE1C_bp); break;
  case toIntNum(Interrupt::TIMER1_OVERFLOW                ): util::setBit(_TIMSK1, TOIE1_bp ); break;
  case toIntNum(Interrupt::TIMER0_COMPARE_A               ): util::setBit(_TIMSK0, OCIE0A_bp); break;
  case toIntNum(Interrupt::TIMER0_COMPARE_B               ): util::setBit(_TIMSK0, OCIE0B_bp); break;
  case toIntNum(Interrupt::TIMER0_OVERFLOW                ): util::setBit(_TIMSK0, TOIE0_bp ); break;
  case toIntNum(Interrupt::SPI_SERIAL_TRANSFER_COMPLETE   ): util::setBit(_SPCR  , SPIE_bp  ); break;
  case toIntNum(Interrupt::USART0_RECEIVE_COMPLETE        ): util::setBit(_UCSR0B, RXCIE0_bp); break;
  case toIntNum(Interrupt::USART0_UART_DATA_REGISTER_EMPTY): util::setBit(_UCSR0B, UDRIE0_bp); break;
  case toIntNum(Interrupt::USART0_TRANSMIT_COMPLETE       ): util::setBit(_UCSR0B, TXCIE0_bp); break;
  case toIntNum(Interrupt::ANALOG_COMPARATOR              ): util::setBit(_ACSR  , ACIE_bp  ); break;
  case toIntNum(Interrupt::ANALOG_DIGITAL_CONVERTER       ): util::setBit(_ADCSRA, ADIE_bp  ); break;
  case toIntNum(Interrupt::EEPROM_READY                   ): util::setBit(_EECR  , EERIE_bp ); break;
  case toIntNum(Interrupt::TIMER3_CAPTURE                 ): util::setBit(_TIMSK3, ICIE3_bp ); break;
  case toIntNum(Interrupt::TIMER3_COMPARE_A               ): util::setBit(_TIMSK3, OCIE3A_bp); break;
  case toIntNum(Interrupt::TIMER3_COMPARE_B               ): util::setBit(_TIMSK3, OCIE3B_bp); break;
  case toIntNum(Interrupt::TIMER3_COMPARE_C               ): util::setBit(_TIMSK3, OCIE3C_bp); break;
  case toIntNum(Interrupt::TIMER3_OVERFLOW                ): util::setBit(_TIMSK3, TOIE3_bp ); break;
  case toIntNum(Interrupt::USART1_RECEIVE_COMPLETE        ): util::setBit(_UCSR1B, RXCIE1_bp); break;
  case toIntNum(Interrupt::USART1_UART_DATA_REGISTER_EMPTY): util::setBit(_UCSR1B, UDRIE1_bp); break;
  case toIntNum(Interrupt::USART1_TRANSMIT_COMPLETE       ): util::setBit(_UCSR1B, TXCIE1_bp); break;
  case toIntNum(Interrupt::TWO_WIRE_INT                   ): util::setBit(_TWCR  , TWIE_bp  ); break;
  case toIntNum(Interrupt::SPM_READY                      ): util::setBit(_SPMCSR, SPMIE_bp ); break;
  case toIntNum(Interrupt::TIMER4_CAPTURE                 ): util::setBit(_TIMSK4, ICIE4_bp ); break;
  case toIntNum(Interrupt::TIMER4_COMPARE_A               ): util::setBit(_TIMSK4, OCIE4A_bp); break;
  case toIntNum(Interrupt::TIMER4_COMPARE_B               ): util::setBit(_TIMSK4, OCIE4B_bp); break;
  case toIntNum(Interrupt::TIMER4_COMPARE_C               ): util::setBit(_TIMSK4, OCIE4C_bp); break;
  case toIntNum(Interrupt::TIMER4_OVERFLOW                ): util::setBit(_TIMSK4, TOIE4_bp ); break;
  case toIntNum(Interrupt::TIMER5_CAPTURE                 ): util::setBit(_TIMSK5, ICIE5_bp ); break;
  case toIntNum(Interrupt::TIMER5_COMPARE_A               ): util::setBit(_TIMSK5, OCIE5A_bp); break;
  case toIntNum(Interrupt::TIMER5_COMPARE_B               ): util::setBit(_TIMSK5, OCIE5B_bp); break;
  case toIntNum(Interrupt::TIMER5_COMPARE_C               ): util::setBit(_TIMSK5, OCIE5C_bp); break;
  case toIntNum(Interrupt::TIMER5_OVERFLOW                ): util::setBit(_TIMSK5, TOIE5_bp ); break;
  case toIntNum(Interrupt::USART2_RECEIVE_COMPLETE        ): util::setBit(_UCSR2B, RXCIE2_bp); break;
  case toIntNum(Interrupt::USART2_UART_DATA_REGISTER_EMPTY): util::setBit(_UCSR2B, UDRIE2_bp); break;
  case toIntNum(Interrupt::USART2_TRANSMIT_COMPLETE       ): util::setBit(_UCSR2B, TXCIE2_bp); break;
  case toIntNum(Interrupt::USART3_RECEIVE_COMPLETE        ): util::setBit(_UCSR3B, RXCIE3_bp); break;
  case toIntNum(Interrupt::USART3_UART_DATA_REGISTER_EMPTY): util::setBit(_UCSR3B, UDRIE3_bp); break;
  case toIntNum(Interrupt::USART3_TRANSMIT_COMPLETE       ): util::setBit(_UCSR3B, TXCIE3_bp); break;
#if defined(MCU_ARCH_avr)
  case toIntNum(Interrupt::GLOBAL                         ): asm volatile("sei");    break;
#endif
  default                                                  : /* DO NOTHING */        break;
  }
}

