snowfox-project/snowfox/src/hal/avr/common/ATMEGA640_1280_2560/InterruptController.cpp
void InterruptController::disableInterrupt(uint8_t const int_num)
{
  switch(int_num)
  {
  case toIntNum(Interrupt::EXTERNAL_INT0                  ): util::clrBit(_EIMSK , INT0_bp  ); break;
  case toIntNum(Interrupt::EXTERNAL_INT1                  ): util::clrBit(_EIMSK , INT1_bp  ); break;
  case toIntNum(Interrupt::EXTERNAL_INT2                  ): util::clrBit(_EIMSK , INT2_bp  ); break;
  case toIntNum(Interrupt::EXTERNAL_INT3                  ): util::clrBit(_EIMSK , INT3_bp  ); break;
  case toIntNum(Interrupt::EXTERNAL_INT4                  ): util::clrBit(_EIMSK , INT4_bp  ); break;
  case toIntNum(Interrupt::EXTERNAL_INT5                  ): util::clrBit(_EIMSK , INT5_bp  ); break;
  case toIntNum(Interrupt::EXTERNAL_INT6                  ): util::clrBit(_EIMSK , INT6_bp  ); break;
  case toIntNum(Interrupt::EXTERNAL_INT7                  ): util::clrBit(_EIMSK , INT7_bp  ); break;
  case toIntNum(Interrupt::PIN_CHANGE_INT0                ): util::clrBit(_PCICR , PCIE0_bp ); break;
  case toIntNum(Interrupt::PIN_CHANGE_INT1                ): util::clrBit(_PCICR , PCIE1_bp ); break;
  case toIntNum(Interrupt::PIN_CHANGE_INT2                ): util::clrBit(_PCICR , PCIE2_bp ); break;
  case toIntNum(Interrupt::WATCHDOG_TIMER                 ): util::clrBit(_WDTCSR, WDIE_bp  ); break;
  case toIntNum(Interrupt::TIMER2_COMPARE_A               ): util::clrBit(_TIMSK2, OCIE2A_bp); break;
  case toIntNum(Interrupt::TIMER2_COMPARE_B               ): util::clrBit(_TIMSK2, OCIE2B_bp); break;
  case toIntNum(Interrupt::TIMER2_OVERFLOW                ): util::clrBit(_TIMSK2, TOIE2_bp ); break;
  case toIntNum(Interrupt::TIMER1_CAPTURE                 ): util::clrBit(_TIMSK1, ICIE1_bp ); break;
  case toIntNum(Interrupt::TIMER1_COMPARE_A               ): util::clrBit(_TIMSK1, OCIE1A_bp); break;
  case toIntNum(Interrupt::TIMER1_COMPARE_B               ): util::clrBit(_TIMSK1, OCIE1B_bp); break;
  case toIntNum(Interrupt::TIMER1_COMPARE_C               ): util::clrBit(_TIMSK1, OCIE1C_bp); break;
  case toIntNum(Interrupt::TIMER1_OVERFLOW                ): util::clrBit(_TIMSK1, TOIE1_bp ); break;
  case toIntNum(Interrupt::TIMER0_COMPARE_A               ): util::clrBit(_TIMSK0, OCIE0A_bp); break;
  case toIntNum(Interrupt::TIMER0_COMPARE_B               ): util::clrBit(_TIMSK0, OCIE0B_bp); break;
  case toIntNum(Interrupt::TIMER0_OVERFLOW                ): util::clrBit(_TIMSK0, TOIE0_bp ); break;
  case toIntNum(Interrupt::SPI_SERIAL_TRANSFER_COMPLETE   ): util::clrBit(_SPCR  , SPIE_bp  ); break;
  case toIntNum(Interrupt::USART0_RECEIVE_COMPLETE        ): util::clrBit(_UCSR0B, RXCIE0_bp); break;
  case toIntNum(Interrupt::USART0_UART_DATA_REGISTER_EMPTY): util::clrBit(_UCSR0B, UDRIE0_bp); break;
  case toIntNum(Interrupt::USART0_TRANSMIT_COMPLETE       ): util::clrBit(_UCSR0B, TXCIE0_bp); break;
  case toIntNum(Interrupt::ANALOG_COMPARATOR              ): util::clrBit(_ACSR  , ACIE_bp  ); break;
  case toIntNum(Interrupt::ANALOG_DIGITAL_CONVERTER       ): util::clrBit(_ADCSRA, ADIE_bp  ); break;
  case toIntNum(Interrupt::EEPROM_READY                   ): util::clrBit(_EECR  , EERIE_bp ); break;
  case toIntNum(Interrupt::TIMER3_CAPTURE                 ): util::clrBit(_TIMSK3, ICIE3_bp ); break;
  case toIntNum(Interrupt::TIMER3_COMPARE_A               ): util::clrBit(_TIMSK3, OCIE3A_bp); break;
  case toIntNum(Interrupt::TIMER3_COMPARE_B               ): util::clrBit(_TIMSK3, OCIE3B_bp); break;
  case toIntNum(Interrupt::TIMER3_COMPARE_C               ): util::clrBit(_TIMSK3, OCIE3C_bp); break;
  case toIntNum(Interrupt::TIMER3_OVERFLOW                ): util::clrBit(_TIMSK3, TOIE3_bp ); break;
  case toIntNum(Interrupt::USART1_RECEIVE_COMPLETE        ): util::clrBit(_UCSR1B, RXCIE1_bp); break;
  case toIntNum(Interrupt::USART1_UART_DATA_REGISTER_EMPTY): util::clrBit(_UCSR1B, UDRIE1_bp); break;
  case toIntNum(Interrupt::USART1_TRANSMIT_COMPLETE       ): util::clrBit(_UCSR1B, TXCIE1_bp); break;
  case toIntNum(Interrupt::TWO_WIRE_INT                   ): util::clrBit(_TWCR  , TWIE_bp  ); break;
  case toIntNum(Interrupt::SPM_READY                      ): util::clrBit(_SPMCSR, SPMIE_bp ); break;
  case toIntNum(Interrupt::TIMER4_CAPTURE                 ): util::clrBit(_TIMSK4, ICIE4_bp ); break;
  case toIntNum(Interrupt::TIMER4_COMPARE_A               ): util::clrBit(_TIMSK4, OCIE4A_bp); break;
  case toIntNum(Interrupt::TIMER4_COMPARE_B               ): util::clrBit(_TIMSK4, OCIE4B_bp); break;
  case toIntNum(Interrupt::TIMER4_COMPARE_C               ): util::clrBit(_TIMSK4, OCIE4C_bp); break;
  case toIntNum(Interrupt::TIMER4_OVERFLOW                ): util::clrBit(_TIMSK4, TOIE4_bp ); break;
  case toIntNum(Interrupt::TIMER5_CAPTURE                 ): util::clrBit(_TIMSK5, ICIE5_bp ); break;
  case toIntNum(Interrupt::TIMER5_COMPARE_A               ): util::clrBit(_TIMSK5, OCIE5A_bp); break;
  case toIntNum(Interrupt::TIMER5_COMPARE_B               ): util::clrBit(_TIMSK5, OCIE5B_bp); break;
  case toIntNum(Interrupt::TIMER5_COMPARE_C               ): util::clrBit(_TIMSK5, OCIE5C_bp); break;
  case toIntNum(Interrupt::TIMER5_OVERFLOW                ): util::clrBit(_TIMSK5, TOIE5_bp ); break;
  case toIntNum(Interrupt::USART2_RECEIVE_COMPLETE        ): util::clrBit(_UCSR2B, RXCIE2_bp); break;
  case toIntNum(Interrupt::USART2_UART_DATA_REGISTER_EMPTY): util::clrBit(_UCSR2B, UDRIE2_bp); break;
  case toIntNum(Interrupt::USART2_TRANSMIT_COMPLETE       ): util::clrBit(_UCSR2B, TXCIE2_bp); break;
  case toIntNum(Interrupt::USART3_RECEIVE_COMPLETE        ): util::clrBit(_UCSR3B, RXCIE3_bp); break;
  case toIntNum(Interrupt::USART3_UART_DATA_REGISTER_EMPTY): util::clrBit(_UCSR3B, UDRIE3_bp); break;
  case toIntNum(Interrupt::USART3_TRANSMIT_COMPLETE       ): util::clrBit(_UCSR3B, TXCIE3_bp); break;
#if defined(MCU_ARCH_avr)
  case toIntNum(Interrupt::GLOBAL                         ): asm volatile("cli");     break;
#endif
  default                                                  : /* DO NOTHING */         break;
  }
}

void InterruptController::registerInterruptCallback(uint8_t const int_num, interface::InterruptCallback * interrupt_callback)
{
  switch(int_num)
  {
  case toIntNum(Interrupt::EXTERNAL_INT0                  ): isr_external_int0                   = interrupt_callback; break;
  case toIntNum(Interrupt::EXTERNAL_INT1                  ): isr_external_int1                   = interrupt_callback; break;
  case toIntNum(Interrupt::EXTERNAL_INT2                  ): isr_external_int2                   = interrupt_callback; break;
  case toIntNum(Interrupt::EXTERNAL_INT3                  ): isr_external_int3                   = interrupt_callback; break;
  case toIntNum(Interrupt::EXTERNAL_INT4                  ): isr_external_int4                   = interrupt_callback; break;
  case toIntNum(Interrupt::EXTERNAL_INT5                  ): isr_external_int5                   = interrupt_callback; break;
  case toIntNum(Interrupt::EXTERNAL_INT6                  ): isr_external_int6                   = interrupt_callback; break;
  case toIntNum(Interrupt::EXTERNAL_INT7                  ): isr_external_int7                   = interrupt_callback; break;
  case toIntNum(Interrupt::PIN_CHANGE_INT0                ): isr_pin_change_int0                 = interrupt_callback; break;
  case toIntNum(Interrupt::PIN_CHANGE_INT1                ): isr_pin_change_int1                 = interrupt_callback; break;
  case toIntNum(Interrupt::PIN_CHANGE_INT2                ): isr_pin_change_int2                 = interrupt_callback; break;
  case toIntNum(Interrupt::WATCHDOG_TIMER                 ): isr_watchdog_timer                  = interrupt_callback; break;
  case toIntNum(Interrupt::TIMER2_COMPARE_A               ): isr_timer2_compare_a                = interrupt_callback; break;
  case toIntNum(Interrupt::TIMER2_COMPARE_B               ): isr_timer2_compare_b                = interrupt_callback; break;
  case toIntNum(Interrupt::TIMER2_OVERFLOW                ): isr_timer2_overflow                 = interrupt_callback; break;
  case toIntNum(Interrupt::TIMER1_CAPTURE                 ): isr_timer1_capture                  = interrupt_callback; break;
  case toIntNum(Interrupt::TIMER1_COMPARE_A               ): isr_timer1_compare_a                = interrupt_callback; break;
  case toIntNum(Interrupt::TIMER1_COMPARE_B               ): isr_timer1_compare_b                = interrupt_callback; break;
  case toIntNum(Interrupt::TIMER1_COMPARE_C               ): isr_timer1_compare_c                = interrupt_callback; break;
  case toIntNum(Interrupt::TIMER1_OVERFLOW                ): isr_timer1_overflow                 = interrupt_callback; break;
  case toIntNum(Interrupt::TIMER0_COMPARE_A               ): isr_timer0_compare_a                = interrupt_callback; break;
  case toIntNum(Interrupt::TIMER0_COMPARE_B               ): isr_timer0_compare_b                = interrupt_callback; break;
  case toIntNum(Interrupt::TIMER0_OVERFLOW                ): isr_timer0_overflow                 = interrupt_callback; break;
  case toIntNum(Interrupt::SPI_SERIAL_TRANSFER_COMPLETE   ): isr_spi_serial_transfer_complete    = interrupt_callback; break;
  case toIntNum(Interrupt::USART0_RECEIVE_COMPLETE        ): isr_usart0_receive_complete         = interrupt_callback; break;
  case toIntNum(Interrupt::USART0_UART_DATA_REGISTER_EMPTY): isr_usart0_uart_data_register_empty = interrupt_callback; break;
  case toIntNum(Interrupt::USART0_TRANSMIT_COMPLETE       ): isr_usart0_transmit_complete        = interrupt_callback; break;
  case toIntNum(Interrupt::ANALOG_COMPARATOR              ): isr_analog_comparator               = interrupt_callback; break;
  case toIntNum(Interrupt::ANALOG_DIGITAL_CONVERTER       ): isr_analog_digital_converter        = interrupt_callback; break;
  case toIntNum(Interrupt::EEPROM_READY                   ): isr_eeprom_ready                    = interrupt_callback; break;
  case toIntNum(Interrupt::TIMER3_CAPTURE                 ): isr_timer3_capture                  = interrupt_callback; break;
  case toIntNum(Interrupt::TIMER3_COMPARE_A               ): isr_timer3_compare_a                = interrupt_callback; break;
  case toIntNum(Interrupt::TIMER3_COMPARE_B               ): isr_timer3_compare_b                = interrupt_callback; break;
  case toIntNum(Interrupt::TIMER3_COMPARE_C               ): isr_timer3_compare_c                = interrupt_callback; break;
  case toIntNum(Interrupt::TIMER3_OVERFLOW                ): isr_timer3_overflow                 = interrupt_callback; break;
  case toIntNum(Interrupt::USART1_RECEIVE_COMPLETE        ): isr_usart1_receive_complete         = interrupt_callback; break;
  case toIntNum(Interrupt::USART1_UART_DATA_REGISTER_EMPTY): isr_usart1_uart_data_register_empty = interrupt_callback; break;
  case toIntNum(Interrupt::USART1_TRANSMIT_COMPLETE       ): isr_usart1_transmit_complete        = interrupt_callback; break;
  case toIntNum(Interrupt::TWO_WIRE_INT                   ): isr_two_wire_int                    = interrupt_callback; break;
  case toIntNum(Interrupt::SPM_READY                      ): isr_spm_ready                       = interrupt_callback; break;
  case toIntNum(Interrupt::TIMER4_CAPTURE                 ): isr_timer4_capture                  = interrupt_callback; break;
  case toIntNum(Interrupt::TIMER4_COMPARE_A               ): isr_timer4_compare_a                = interrupt_callback; break;
  case toIntNum(Interrupt::TIMER4_COMPARE_B               ): isr_timer4_compare_b                = interrupt_callback; break;
  case toIntNum(Interrupt::TIMER4_COMPARE_C               ): isr_timer4_compare_c                = interrupt_callback; break;
  case toIntNum(Interrupt::TIMER4_OVERFLOW                ): isr_timer4_overflow                 = interrupt_callback; break;
  case toIntNum(Interrupt::TIMER5_CAPTURE                 ): isr_timer5_capture                  = interrupt_callback; break;
  case toIntNum(Interrupt::TIMER5_COMPARE_A               ): isr_timer5_compare_a                = interrupt_callback; break;
  case toIntNum(Interrupt::TIMER5_COMPARE_B               ): isr_timer5_compare_b                = interrupt_callback; break;
  case toIntNum(Interrupt::TIMER5_COMPARE_C               ): isr_timer5_compare_c                = interrupt_callback; break;
  case toIntNum(Interrupt::TIMER5_OVERFLOW                ): isr_timer5_overflow                 = interrupt_callback; break;
  case toIntNum(Interrupt::USART2_RECEIVE_COMPLETE        ): isr_usart2_receive_complete         = interrupt_callback; break;
  case toIntNum(Interrupt::USART2_UART_DATA_REGISTER_EMPTY): isr_usart2_uart_data_register_empty = interrupt_callback; break;
  case toIntNum(Interrupt::USART2_TRANSMIT_COMPLETE       ): isr_usart2_transmit_complete        = interrupt_callback; break;
  case toIntNum(Interrupt::USART3_RECEIVE_COMPLETE        ): isr_usart3_receive_complete         = interrupt_callback; break;
  case toIntNum(Interrupt::USART3_UART_DATA_REGISTER_EMPTY): isr_usart3_uart_data_register_empty = interrupt_callback; break;
  case toIntNum(Interrupt::USART3_TRANSMIT_COMPLETE       ): isr_usart3_transmit_complete        = interrupt_callback; break;
  default                                                  : /* DO NOTHING */                                          break;
  }
}

/**************************************************************************************
 * NAMESPACE
 **************************************************************************************/

} /* ATMEGA640_1280_2560 */

