snowfox-project/snowfox/src/hal/avr/common/ATMEGA640_1280_2560/InterruptController.cpp
} /* hal */

} /* spectre */

/**************************************************************************************
 * INTERRUPT SERVICE ROUTINES
 **************************************************************************************/

#if defined(MCU_ARCH_avr) && ( defined(MCU_TYPE_atmega2560) || defined(MCU_TYPE_atmega1280) || defined(MCU_TYPE_atmega640) )

/**************************************************************************************
 * INCLUDE
 **************************************************************************************/

#include <avr/io.h>
#include <avr/interrupt.h>

/**************************************************************************************
 * NAMESPACES
 **************************************************************************************/

using namespace spectre::hal::ATMEGA640_1280_2560;

/**************************************************************************************
 * INTERRUPT SERVICE ROUTINES
 **************************************************************************************/

ISR(INT0_vect)
{
  executeCallbackIfValid(isr_external_int0);
}

ISR(INT1_vect)
{
  executeCallbackIfValid(isr_external_int1);
}

ISR(INT2_vect)
{
  executeCallbackIfValid(isr_external_int2);
}

ISR(INT3_vect)
{
  executeCallbackIfValid(isr_external_int3);
}

ISR(INT4_vect)
{
  executeCallbackIfValid(isr_external_int4);
}

ISR(INT5_vect)
{
  executeCallbackIfValid(isr_external_int5);
}

ISR(INT6_vect)
{
  executeCallbackIfValid(isr_external_int6);
}

ISR(INT7_vect)
{
  executeCallbackIfValid(isr_external_int7);
}

ISR(PCINT0_vect)
{
  executeCallbackIfValid(isr_pin_change_int0);
}

ISR(PCINT1_vect)
{
  executeCallbackIfValid(isr_pin_change_int1);
}

ISR(PCINT2_vect)
{
  executeCallbackIfValid(isr_pin_change_int2);
}

ISR(WDT_vect)
{
  executeCallbackIfValid(isr_watchdog_timer);
}

ISR(TIMER2_COMPA_vect)
{
  executeCallbackIfValid(isr_timer2_compare_a);
}

ISR(TIMER2_COMPB_vect)
{
  executeCallbackIfValid(isr_timer2_compare_b);
}

ISR(TIMER2_OVF_vect)
{
  executeCallbackIfValid(isr_timer2_overflow);
}

ISR(TIMER1_CAPT_vect)
{
  executeCallbackIfValid(isr_timer1_capture);
}

ISR(TIMER1_COMPA_vect)
{
  executeCallbackIfValid(isr_timer1_compare_a);
}

ISR(TIMER1_COMPB_vect)
{
  executeCallbackIfValid(isr_timer1_compare_b);
}

ISR(TIMER1_COMPC_vect)
{
  executeCallbackIfValid(isr_timer1_compare_c);
}

ISR(TIMER1_OVF_vect)
{
  executeCallbackIfValid(isr_timer1_overflow);
}

ISR(TIMER0_COMPA_vect)
{
  executeCallbackIfValid(isr_timer0_compare_a);
}

ISR(TIMER0_COMPB_vect)
{
  executeCallbackIfValid(isr_timer0_compare_b);
}

ISR(TIMER0_OVF_vect)
{
  executeCallbackIfValid(isr_timer0_overflow);
}

ISR(SPI_STC_vect)
{
  executeCallbackIfValid(isr_spi_serial_transfer_complete);
}

ISR(USART0_RX_vect)
{
  executeCallbackIfValid(isr_usart0_receive_complete);
}

ISR(USART0_UDRE_vect)
{
  executeCallbackIfValid(isr_usart0_uart_data_register_empty);
}

ISR(USART0_TX_vect)
{
  executeCallbackIfValid(isr_usart0_transmit_complete);
}

ISR(ANALOG_COMP_vect)
{
  executeCallbackIfValid(isr_analog_comparator);
}

ISR(ADC_vect)
{
  executeCallbackIfValid(isr_analog_digital_converter);
}

ISR(EE_READY_vect)
{
  executeCallbackIfValid(isr_eeprom_ready);
}

ISR(TIMER3_CAPT_vect)
{
  executeCallbackIfValid(isr_timer3_capture);
}

ISR(TIMER3_COMPA_vect)
{
  executeCallbackIfValid(isr_timer3_compare_a);
}

ISR(TIMER3_COMPB_vect)
{
  executeCallbackIfValid(isr_timer3_compare_b);
}

ISR(TIMER3_COMPC_vect)
{
  executeCallbackIfValid(isr_timer3_compare_c);
}

ISR(TIMER3_OVF_vect)
{
  executeCallbackIfValid(isr_timer3_overflow);
}

ISR(USART1_RX_vect)
{
  executeCallbackIfValid(isr_usart1_receive_complete);
}

ISR(USART1_UDRE_vect)
{
  executeCallbackIfValid(isr_usart1_uart_data_register_empty);
}

ISR(USART1_TX_vect)
{
  executeCallbackIfValid(isr_usart1_transmit_complete);
}

ISR(TWI_vect)
{
  executeCallbackIfValid(isr_two_wire_int);
}

ISR(SPM_READY_vect)
{
  executeCallbackIfValid(isr_spm_ready);
}

ISR(TIMER4_CAPT_vect)
{
  executeCallbackIfValid(isr_timer4_capture);
}

ISR(TIMER4_COMPA_vect)
{
  executeCallbackIfValid(isr_timer4_compare_a);
}

ISR(TIMER4_COMPB_vect)
{
  executeCallbackIfValid(isr_timer4_compare_b);
}

ISR(TIMER4_COMPC_vect)
{
  executeCallbackIfValid(isr_timer4_compare_c);
}

ISR(TIMER4_OVF_vect)
{
  executeCallbackIfValid(isr_timer4_overflow);
}

ISR(TIMER5_CAPT_vect)
{
  executeCallbackIfValid(isr_timer5_capture);
}

ISR(TIMER5_COMPA_vect)
{
  executeCallbackIfValid(isr_timer5_compare_a);
}

ISR(TIMER5_COMPB_vect)
{
  executeCallbackIfValid(isr_timer5_compare_b);
}

ISR(TIMER5_COMPC_vect)
{
  executeCallbackIfValid(isr_timer5_compare_c);
}

ISR(TIMER5_OVF_vect)
{
  executeCallbackIfValid(isr_timer5_overflow);
}

ISR(USART2_RX_vect)
{
  executeCallbackIfValid(isr_usart2_receive_complete);
}

ISR(USART2_UDRE_vect)
{
  executeCallbackIfValid(isr_usart2_uart_data_register_empty);
}

ISR(USART2_TX_vect)
{
  executeCallbackIfValid(isr_usart2_transmit_complete);
}

ISR(USART3_RX_vect)
{
  executeCallbackIfValid(isr_usart3_receive_complete);
}

ISR(USART3_UDRE_vect)
{
  executeCallbackIfValid(isr_usart3_uart_data_register_empty);
}

ISR(USART3_TX_vect)
{
  executeCallbackIfValid(isr_usart3_transmit_complete);
}

#endif /* defined(MCU_ARCH_avr) && ( defined(MCU_TYPE_atmega2560) || defined(MCU_TYPE_atmega1280) || defined(MCU_TYPE_atmega640) ) */
